[
  {
    "id": "1",
    "title": "Mon opinion sur l'excitation publique autour de l'IA",
    "hook": "Un aperçu de l'explosion actuelle des technologies d'IA.",
    "image": "images/blog-thumb-1.png",
    "date": "2025-08-06",
    "content": "Je me souviens du moment où j’ai découvert que je voulais devenir ingénieur en intelligence artificielle. C’était en 2017, lorsqu’un auteur de fiction a décrit ce qu’il appelait une IA « ascendante » (*bottom-up*), un algorithme capable d’imiter les schémas d’apprentissage humains et d’évoluer comme le ferait un bébé. J’ai trouvé ça absolument génial et j’ai immédiatement eu envie de contribuer à rendre une telle chose réelle.\n\nJ’ai donc commencé à apprendre sur l’IA, à comprendre comment fonctionnent les algorithmes, à quoi ils servent et quelles sont leurs limites. Et ces limites, à mon sens, ne sont pas assez mises en avant aujourd’hui.\n\nPuis, fin 2022, ChatGPT est arrivé. Cela a frappé le monde comme une météorite. C’était la première fois depuis des années qu’une technologie captait autant l’attention du grand public, à une échelle comparable à celle de l’iPhone. Avec cet engouement est aussi venue une vague de problèmes : reportages, prises de position d’influenceurs, et une infinité de podcasts mettant en avant des « experts », souvent des figures publiques comme Sam Altman, le PDG d’OpenAI, ou encore le milliardaire Elon Musk.\n\nLes questions qu’on leur posait étaient généralement basiques : comment fonctionne un LLM ? Quel type de travail peut-il réellement accomplir ? Mais la grande question, celle qui revenait sans cesse, c’était : quand atteindra-t-on l’AGI ?\n\nEt là, posez-vous la question : si vous étiez le PDG d’une entreprise qui dépend du financement des investisseurs, admettriez-vous que l’AGI n’arrivera peut-être jamais ? Ou préféreriez-vous vendre le rêve pour maintenir la flamme de l'engouement ? Exactement.\n\nJe pense que le public est emporté dans un mélange de peur et de fascination. La peur que l’IA prenne le contrôle du monde. Et oui, l’IA remplacera certains emplois, comme les tracteurs l’ont fait autrefois dans les fermes. Mais je ne crois pas que nous soyons proches d’une intelligence artificielle omnisciente, en perpétuelle croissance, qui dirigerait la société."
  },
  {
    "id": "2",
    "title": "Un aperçu de l'atmosphère de l'industrie du jeu vidéo",
    "hook": "Pourquoi les consommateurs comptent et comment leurs préférences façonnent le marché.",
    "image": "images/blog-thumb-3.png",
    "date": "2025-08-20",
    "content" : "Mortal Kombat, Pokémon, The Legend of Zelda, Halo, World of Warcraft, Call of Duty.\n\nJ’ai grandi avec ces jeux, tout comme beaucoup de personnes de ma génération. Ils représentaient quelque chose que les développeurs de l’époque avaient bien compris : la clé pour créer un bon jeu vidéo était de se demander « De quoi les joueurs rêvent-ils ? »\n\nMalheureusement, nous sommes entrés dans une ère où cette question ne guide plus l’industrie. À la place, l’accent est mis sur la monétisation, l’allongement artificiel de la durée de vie des jeux, et même des failles légales qui privent les joueurs de leur droit de propriété. S’il existe un moyen d’extorquer davantage le consommateur, les grands éditeurs le trouveront. Les battle pass, la revente du même jeu chaque année comme les titres EA Sports, la fermeture de serveurs live-service, les missions quotidiennes, et même des mécaniques de jeu qui s'approche du casino, toutes ces tactiques existent pour soutirer chaque dollar possible d’une licence.\n\nLes jeux vidéo vendaient autrefois des rêves. On pouvait vivre l’épopée d’un héros sans aucune condition. Aujourd’hui, trop souvent, les joueurs ressentent le besoin de lutter contre ces pratiques à coups de boycotts, d’indignation en ligne, et malheureusement, de piratage."
  },
  {
    "id": "3",
    "title": "Pourquoi les LLM ne pensent pas vraiment",
    "hook": "Une vue simplifiée des limites des grands modèles de langage.",
    "image": "images/blog-thumb-2.png",
    "date": "2025-08-13",
    "content" : "Il existe une idée reçue selon laquelle les LLM seraient capables de « penser ». Dans le sens de la capacité à faire usage de la raison. C’est une erreur facile à commettre. Je ne corrige pas les gens au quotidien, mais je vais le faire ici.\n\nLes LLM sont des algorithmes, des systèmes mathématiques qui produisent des résultats basés sur des probabilités. Ils fonctionnent en attribuant des valeurs aux mots selon la fréquence à laquelle ces mots apparaissent ensemble dans leurs données d’entraînement.\n\nPar exemple, si vous demandez à un humain ce dont une devanture de magasin a besoin, il visualisera des commerces qu’il a vus, se rappellera d’expériences personnelles et choisira des éléments en fonction de leur utilité : porte, fenêtres, enseignes, éclairage, etc. Un LLM, en revanche, ne « visualise » rien. Il analyse les schémas statistiques autour du mot « devanture » et sélectionne les mots les plus susceptibles de suivre.\n\nCela signifie qu’il peut très bien produire une réponse linguistiquement correcte mais déconnectée de la réalité. Il ne comprend pas qu’une porte a une fonction pratique ; il sait seulement que le mot « porte » apparaît souvent quand on décrit une devanture de magasin.\n\nLes LLM manquent aussi de bon sens puisqu’ils n’ont aucune expérience personnelle à laquelle se référer. Il n’existe pas de raisonnement en chaîne au sens humain, seulement une correspondance statistique de motifs.\n\nLes hallucinations sont l’un des signes les plus évidents de cette limite. Quand le modèle n’a pas assez d’informations, il ne répond pas « Je ne sais pas ». À la place, il devine, en assemblant des mots qui collent au schéma même si le résultat est faux. C’est pourquoi on voit parfois l’IA inventer des livres, des auteurs ou des événements qui n’ont jamais existé.\n\nLa bonne nouvelle, c’est que les hallucinations font partie des problèmes les plus faciles à corriger dans l’IA. Avec de meilleures données d’entraînement et de meilleurs systèmes, on peut les réduire de manière significative.\n\nLes LLM sont d’excellents outils pour générer du langage, mais ce ne sont pas des penseurs. Ils ne comprennent pas le monde, ne forment pas d’idées et ne raisonnent pas sur les problèmes comme les humains. Ce sont des machines avancées de reconnaissance de motifs. C’est à la fois leur force et leur plus grande faiblesse."
  },
  {
    "id": "4",
    "title": "Comment je rends le travail sur le code amusant",
    "hook": "Habitudes et stratégies personnelles pour un codage agréable.",
    "image": "images/blog-thumb-4.png",
    "date": "2025-08-27",
    "content" : "Je crois que tout travail finit par perdre son éclat. C’est simplement de la psychologie humaine de base. Quand ton cerveau est exposé à la même tâche suffisamment longtemps, elle cesse d’être stimulante, peu importe à quel point elle était amusante au début. C’est pourquoi il faut créer sa propre dose de plaisir en intégrant de petites routines dans la journée qui apportent un souffle de nouveauté. C’est pour cette raison que des activités comme Wordle, le sudoku ou les mots croisés plaisent autant : elles changent chaque jour, s’intègrent facilement au quotidien et brisent la monotonie.\n\nJ’ai trouvé mes propres moyens de garder le code intéressant et de rendre les tâches plus uniques à aborder, ce qui améliore à la fois mon humeur et ma productivité. Pour moi, tout commence par l’environnement. J’utilise une application qui me permet de définir des fonds d’écran animés, et j’adore les changer toutes les deux semaines pour donner un nouveau look à mes écrans. J’utilise aussi d’autres petits outils pour personnaliser mon bureau. Ça peut sembler anodin, mais prendre deux minutes pour choisir un nouveau « compagnon de code » pour la semaine rend le moment où je m’assois à mon ordinateur moins routinier.\n\nL’autre aspect de mon environnement, c’est le son. J’alterne entre des pistes d’ambiance et de la musique selon les jours. La pluie, le lo-fi, ou même les orages sont des sons que j’aime avoir dans mes oreilles quand je suis en train de démêler un bug sournois dans la base de code. Parfois, ce n’est pas tant la musique elle-même que l’atmosphère qu’elle crée, qui me donne envie de continuer.\n\nAu final, rendre le code amusant ne tient pas à de grands changements ni à la nature du projet, mais aux petits détails qui gardent l’esprit curieux et le travail agréable."

  }
]